app/views/characters/index.html.erb

SELECT "superpowers".* FROM "superpowers" WHERE "superpowers"."character_id" = ?  [["character_id", 1]]
---
        <td><%= link_to character.alias, character_path(character) %></td>
        <td><% character.superpowers.each do |cs| %>

SELECT "characters".* FROM "characters" WHERE (name LIKE '%Steve%')
---
<ol>
<% @characters.super_soldier_serum_characters.each do |character| %>

SELECT "characters".* FROM "characters" WHERE (name LIKE '%Steve%')
---
<ol>
<% @characters.magic_characters.each do |character| %>