app/controllers/battles_controller.rb

SELECT "battles".* FROM "battles"
---
  def index
    @battles=Battle.all