app/controllers/movies_controller.rb

  def create
    @movie=Movie.create(movie_params)
---
INSERT INTO "movies" ("name", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Captain Marvel"], ["year", 2019], ["created_at", "2019-09-03 01:52:52.860921"], ["updated_at", "2019-09-03 01:52:52.860921"]]

    def find_movie
      @movie=Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]