app/controllers/static_pages_controller.rb

  def home
    if session[:user_id]
      @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]