app/controllers/users_controller.rb

    def create
        @user=User.create(user_params)
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "a"], ["password_digest", "$2a$10$wu1zFbPSxMV8nvlzowxZHO0OyC.XOXKCykUQ3VQhp9q13rLx.M1Eu"], ["created_at", "2019-06-10 18:14:31.208036"], ["updated_at", "2019-06-10 18:14:31.208036"]]